examples/openfoam7/singleBuilding/kEpsilon/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $turbulentEpsilon;

boundaryField
{

    inlet
    {
        type            EpsilonABL;
        #include        "include/ABLConditions"
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    ground
    {
        type            epsilonRoughABL;
        #include        "include/ABLConditions"

        z0              uniform $z0;
        ustar           uniform $ustar;
        
        A               uniform $A;
        B               uniform $B;
        C               uniform $C;
        D               uniform $D;
        Etke            uniform $E;
        CmuMax          uniform $CmuMax;
        blendCoeff      uniform $blendCoeff;
        zDir            uniform $zDir;

        thresholdU      uniform $thresholdU;
        thresholdE      uniform $thresholdE;
        thresholdK      uniform $thresholdK;
        thresholdO      uniform $thresholdO;

        constantU       uniform $constantU;
        constantE       uniform $constantE;
        constantK       uniform $constantK;
        constantO       uniform $constantO;

        betaStarMax     uniform $betaStarMax;
        WFbetaStar      uniform $WFbetaStar;

        roughWall       uniform 1.0;
        kappaWF         uniform $kappa;

        E               9.793;
        value           uniform 0;
    }

    building
    {
        type            epsilonWallFunction;
        value           uniform 1.125;
    }

    #include "include/sideAndTopPatches"

    top
    {
        type fixedValue;

        #include        "include/ABLConditions"
        
        zMax            1.0;
        topEps #calc    "(pow($ustar,3) / ($kappa * ($zMax+$z0)))";
       
        value uniform $topEps;
    }

}


// ************************************************************************* //
